# HostElement Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
LoadBase..::..HostElement Property
LoadBase Class See Also
---
The host element for the load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public AnalyticalModel HostElement { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostElement As AnalyticalModel
	Get
```

Visual C++
---
```text
public:
property AnalyticalModel^ HostElement {
	AnalyticalModel^ get ();
}
```

# Remarks
If the load is hosted this is the AnalyticalModel element that hosts the load. If the load is not hosted, "null" is returned.
# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace